bassem-mostafa/RTC_STM32L496VGT6P/RTC_STM32L496VGT6P.c
// #############################################################################
// #### Copyright ##############################################################
// #############################################################################

/*
 * Copyright 2024 BaSSeM
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

// #############################################################################
// #### Description ############################################################
// #############################################################################

// #############################################################################
// #### Control Include(s) #####################################################
// #############################################################################

#include "Platform.h"

// #############################################################################
// #### Control Macro(s) #######################################################
// #############################################################################

#ifndef DEBUG
    #define DEBUG
#endif

#ifdef DEBUG
    #undef DEBUG
#endif

// #############################################################################
// #### File Guard #############################################################
// #############################################################################

#ifdef STM32L496xx

// #############################################################################
// #### Include(s) #############################################################
// #############################################################################

    #include "../../RTC_Internal.h"
    #include "RTC_STM32L496VGT6P.h"

    #include "stm32l4xx.h"
    #include "stm32l4xx_hal_rtc.h"

// #############################################################################
// #### Private Macro(s) #######################################################
// #############################################################################

    #define RTC_STM32L496VGT6P_TICKS_PER_MS 2

// #############################################################################
// #### Private Type(s) ########################################################
// #############################################################################

typedef enum RTC_STM32L496VGT6P_Event
{
    RTC_STM32L496VGT6P_Event_None = 0,
    RTC_STM32L496VGT6P_Event_InterruptWakeup = UTIL_BIT( 0 ),
    RTC_STM32L496VGT6P_Event_InterruptAlarm = UTIL_BIT( 1 ),
} RTC_STM32L496VGT6P_Event_t;

typedef struct RTC_STM32L496VGT6P_Instance
{
    RTC_HandleTypeDef RTCx;
    RTC_STM32L496VGT6P_Timestamp_t Timestamp;
    RTC_STM32L496VGT6P_Event_t Event;
} RTC_STM32L496VGT6P_Instance_t;

typedef struct RTC_STM32L496VGT6P_Context
{
    TIM_Timestamp_t Timestamp;
    RTC_STM32L496VGT6P_Instance_t Instance[ RTC_STM32L496VGT6P_Count ];
} RTC_STM32L496VGT6P_Context_t;

// #############################################################################
// #### Private Method(s) Prototype ############################################
// #############################################################################

void HAL_RTCEx_WakeUpTimerEventCallback( RTC_HandleTypeDef * hrtc );
void RTC_WKUP_IRQHandler( void );
void RTC_Alarm_IRQHandler( void );

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_GetTimestamp( RTC_STM32L496VGT6P_t RTCx, RTC_STM32L496VGT6P_Timestamp_t * Timestamp );
static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_SetTimestamp( RTC_STM32L496VGT6P_t RTCx, RTC_STM32L496VGT6P_Timestamp_t Timestamp );
static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_SetAlarm( RTC_STM32L496VGT6P_t RTCx, RTC_STM32L496VGT6P_Timestamp_t Timestamp );

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_Commit( RTC_STM32L496VGT6P_t RTCx );

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_Initialize( RTC_STM32L496VGT6P_t RTCx );
static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_Cycle( RTC_STM32L496VGT6P_t RTCx );
static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_DeInitialize( RTC_STM32L496VGT6P_t RTCx );

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Context_Initialize( void );
static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Context_Cycle( void );
static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Context_DeInitialize( void );

// #############################################################################
// #### Private Variable(s) ####################################################
// #############################################################################

static RTC_STM32L496VGT6P_Context_t RTC_STM32L496VGT6P_Context;

// #############################################################################
// #### Private Method(s) ######################################################
// #############################################################################

void HAL_RTCEx_WakeUpTimerEventCallback( RTC_HandleTypeDef * hrtc )
{
}

void RTC_WKUP_IRQHandler( void )
{
    RTC_STM32L496VGT6P_Instance_t * Instance = &RTC_STM32L496VGT6P_Context.Instance[ RTC_STM32L496VGT6P_1 ];

    Instance->Event |= RTC_STM32L496VGT6P_Event_InterruptWakeup;

    HAL_RTCEx_WakeUpTimerIRQHandler( &Instance->RTCx );
}

void RTC_Alarm_IRQHandler( void )
{
    RTC_STM32L496VGT6P_Instance_t * Instance = &RTC_STM32L496VGT6P_Context.Instance[ RTC_STM32L496VGT6P_1 ];

    Instance->Event |= RTC_STM32L496VGT6P_Event_InterruptAlarm;

