bassem-mostafa/RTC_STM32L496VGT6P/RTC_STM32L496VGT6P.c
    HAL_RTC_AlarmIRQHandler( &Instance->RTCx );
}

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_GetTimestamp( RTC_STM32L496VGT6P_t RTCx, RTC_STM32L496VGT6P_Timestamp_t * Timestamp )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( RTC=%d, Timestamp=%p )", __FUNCTION__, RTCx, Timestamp );

        RTC_STM32L496VGT6P_Instance_t * Instance = &RTC_STM32L496VGT6P_Context.Instance[ RTCx ];

        // TODO Either update RTC using the context timestamp
        // TODO or get the new timestamp into the context
        // FIXME For now use GET ONLY

        HAL_StatusTypeDef HAL_Status = HAL_OK;
        RTC_TimeTypeDef sTimeStamp;
        RTC_DateTypeDef sTimeStampDate;

        if ( ( HAL_Status = HAL_RTC_GetTime( &Instance->RTCx, &sTimeStamp, RTC_FORMAT_BIN ) ) != HAL_OK )
        {
            // FIXME
            RTC_Warning( "RTC=%d HAL_RTC_GetTime Failed, Status %d", RTCx, HAL_Status );
        }

        if ( ( HAL_Status = HAL_RTC_GetDate( &Instance->RTCx, &sTimeStampDate, RTC_FORMAT_BIN ) ) != HAL_OK )
        {
            // FIXME
            RTC_Warning( "RTC=%d HAL_RTC_GetDate Failed, Status %d", RTCx, HAL_Status );
        }

        // FIXME
        //    if ( HAL_RTCEx_GetTimeStamp( &Instance->RTCx, &sTimeStamp, &sTimeStampDate, RTC_FORMAT_BIN ) != HAL_OK )
        //    {
        //      // FIXME
        //    }

        Instance->Timestamp.Year = 2000 + sTimeStampDate.Year;
        Instance->Timestamp.Month = RTC_Bcd2ToByte( sTimeStampDate.Month );
        Instance->Timestamp.Day = sTimeStampDate.Date;

        Instance->Timestamp.Hour = sTimeStamp.Hours;
        Instance->Timestamp.Minute = sTimeStamp.Minutes;
        Instance->Timestamp.Second = sTimeStamp.Seconds;

        // FIXME
        double subseconds = sTimeStamp.SecondFraction - sTimeStamp.SubSeconds;
        subseconds /= sTimeStamp.SecondFraction + 1;
        Instance->Timestamp.Millisecond = ( uint32_t ) UTIL_SecondToMillisecond( subseconds ) % 1000;
        Instance->Timestamp.Microsecond = ( uint32_t ) UTIL_MillisecondToMicrosecond( UTIL_SecondToMillisecond( subseconds ) ) % 1000;

        Instance->Timestamp.Weekday = sTimeStampDate.WeekDay;

        *Timestamp = Instance->Timestamp;
    }
    while ( 0 );

    return Status;
}

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_SetTimestamp( RTC_STM32L496VGT6P_t RTCx, RTC_STM32L496VGT6P_Timestamp_t Timestamp )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( RTCx=%d, Timestamp={Weekday=%d, Year=%d, Month=%d, Day=%d, Hour=%d, Minute=%d, Second=%d, Millisecond=%d, Microsecond=%d} )", __FUNCTION__, RTCx, Timestamp.Weekday, Timestamp.Year, Timestamp.Month, Timestamp.Day, Timestamp.Hour, Timestamp.Minute, Timestamp.Second, Timestamp.Millisecond, Timestamp.Microsecond );

        RTC_STM32L496VGT6P_Instance_t * Instance = &RTC_STM32L496VGT6P_Context.Instance[ RTCx ];

        RTC_DateTypeDef sTimeStampDate;
        RTC_TimeTypeDef sTimeStamp;

        sTimeStamp.Hours = Timestamp.Hour;
        sTimeStamp.Minutes = Timestamp.Minute;
        sTimeStamp.Seconds = Timestamp.Second;
        sTimeStamp.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
        sTimeStamp.StoreOperation = RTC_STOREOPERATION_RESET;
        if ( HAL_RTC_SetTime( &Instance->RTCx, &sTimeStamp, RTC_FORMAT_BIN ) != HAL_OK )
        {
            Status = RTC_STM32L496VGT6P_Status_Error;
            break;
        }
        sTimeStampDate.WeekDay = Timestamp.Weekday;
        sTimeStampDate.Month = RTC_ByteToBcd2( Timestamp.Month );
        sTimeStampDate.Date = Timestamp.Day;
        sTimeStampDate.Year = Timestamp.Year - 2000;

        if ( HAL_RTC_SetDate( &Instance->RTCx, &sTimeStampDate, RTC_FORMAT_BIN ) != HAL_OK )
        {
            Status = RTC_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_SetAlarm( RTC_STM32L496VGT6P_t RTCx, RTC_STM32L496VGT6P_Timestamp_t Timestamp )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;
    HAL_StatusTypeDef HAL_Status = HAL_OK;

    do
    {
        RTC_Trace( "%s( RTCx=%d, Timestamp={Weekday=%d, Year=%d, Month=%d, Day=%d, Hour=%d, Minute=%d, Second=%d, Millisecond=%d, Microsecond=%d} )", __FUNCTION__, RTCx, Timestamp.Weekday, Timestamp.Year, Timestamp.Month, Timestamp.Day, Timestamp.Hour, Timestamp.Minute, Timestamp.Second, Timestamp.Millisecond, Timestamp.Microsecond );

        RTC_STM32L496VGT6P_Instance_t * Instance = &RTC_STM32L496VGT6P_Context.Instance[ RTCx ];

        RTC_AlarmTypeDef sAlarm;

        UTIL_MemorySetZero( &sAlarm, sizeof( sAlarm ) );

        sAlarm.AlarmTime.Hours = Timestamp.Hour;
        sAlarm.AlarmTime.Minutes = Timestamp.Minute;
        sAlarm.AlarmTime.Seconds = Timestamp.Second;
        // @note sub-seconds register value calculation breakdown:
        // @ref ss_val = ( PREDIV_S - SSR ) / ( PREDIV_S + 1 )
        // SSR = PREDIV_S - ss_val * (PREDIV_S + 1)
        //     = ( PREDIV_S + 1 ) - 1 - ss_val * (PREDIV_S + 1)
        //     = ( PREDIV_S + 1 ) - 1 - ss_val * (PREDIV_S + 1)
        //     = ( PREDIV_S + 1 ) * ( 1 - ss_val ) - 1
        sAlarm.AlarmTime.SubSeconds = ( 1 + ( Instance->RTCx.Instance->PRER & RTC_PRER_PREDIV_S ) ) * ( 1 - UTIL_MillisecondToSecond( Timestamp.Millisecond ) - UTIL_MillisecondToSecond( UTIL_MicrosecondToMillisecond( Timestamp.Microsecond ) ) ) - 1;
        sAlarm.AlarmTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
        sAlarm.AlarmTime.StoreOperation = RTC_STOREOPERATION_RESET;

        sAlarm.AlarmMask = RTC_ALARMMASK_NONE; // @note all timestamp fields MUST match

        sAlarm.SubSeconds = sAlarm.AlarmTime.SubSeconds;
        sAlarm.AlarmSubSecondMask = RTC_ALARMSUBSECONDMASK_NONE;   // @note all timestamp sub-seconds fields MUST match
        sAlarm.AlarmDateWeekDaySel = RTC_ALARMDATEWEEKDAYSEL_DATE; // @note alarm is being selected on date, could be set on weekdays as well `RTC_ALARMDATEWEEKDAYSEL_WEEKDAY`
        switch ( sAlarm.AlarmDateWeekDaySel )
        {
            case RTC_ALARMDATEWEEKDAYSEL_DATE:
                sAlarm.AlarmDateWeekDay = Timestamp.Day;
                break;

            case RTC_ALARMDATEWEEKDAYSEL_WEEKDAY:
                sAlarm.AlarmDateWeekDay = Timestamp.Weekday;
                break;

            default:
                break;
        }

        sAlarm.Alarm = RTC_ALARM_A;

        if ( ( HAL_Status = HAL_RTC_SetAlarm_IT( &Instance->RTCx, &sAlarm, RTC_FORMAT_BIN ) ) != HAL_OK )
        {
            Status = RTC_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

