bassem-mostafa/RTC_STM32L496VGT6P/RTC_STM32L496VGT6P.c
    return Status;
}

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_Commit( RTC_STM32L496VGT6P_t RTCx )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( RTCx=%d )", __FUNCTION__, RTCx );

        RTC_STM32L496VGT6P_Instance_t * Instance = &RTC_STM32L496VGT6P_Context.Instance[ RTCx ];

        UTIL_UNUSED( Instance );

        // FIXME Keep CubeMX generated configurations as is for now
    #if 0
        HAL_StatusTypeDef HAL_Status = HAL_ERROR;
        if ( ( HAL_Status = HAL_RTC_Init( &Instance->RTCx ) ) != HAL_OK )
        {
            Status = RTC_STM32L496VGT6P_Status_Error;
            break;
        }
    #endif
    }
    while ( 0 );

    return Status;
}

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_Initialize( RTC_STM32L496VGT6P_t RTCx )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( RTCx=%d )", __FUNCTION__, RTCx );

        RTC_STM32L496VGT6P_Instance_t * Instance = &RTC_STM32L496VGT6P_Context.Instance[ RTCx ];

        Instance->Event = RTC_STM32L496VGT6P_Event_None;

        // FIXME Is there any RTC configuration to be committed ?
        if ( ( Status = RTC_STM32L496VGT6P_Instance_Commit( RTCx ) ) != RTC_STM32L496VGT6P_Status_Success )
        {
            break;
        }
    }
    while ( 0 );

    return Status;
}

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_Cycle( RTC_STM32L496VGT6P_t RTCx )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( RTCx=%d )", __FUNCTION__, RTCx );

        RTC_STM32L496VGT6P_Instance_t * Instance = &RTC_STM32L496VGT6P_Context.Instance[ RTCx ];
        RTC_STM32L496VGT6P_Event_t Event = Instance->Event; // CAUTION: Has to copy events occurred at the early start of the cycle, so as to be cleared at the end of the cycle,
                                                            //          which let events occurs after that for the next cycle call
        Instance->Event &= ~Event;                          //          Clear captured events

        if ( ( Event & RTC_STM32L496VGT6P_Event_InterruptWakeup ) == RTC_STM32L496VGT6P_Event_InterruptWakeup )
        {
            Event &= ~RTC_STM32L496VGT6P_Event_InterruptWakeup;
            RTC_Debug( "Wake-up Interrupt: RTCx=%d", RTCx );

            // TODO Invoke Callback
        }

        if ( ( Event & RTC_STM32L496VGT6P_Event_InterruptAlarm ) == RTC_STM32L496VGT6P_Event_InterruptAlarm )
        {
            Event &= ~RTC_STM32L496VGT6P_Event_InterruptAlarm;
            RTC_Debug( "Wake-up Alarm: RTCx=%d", RTCx );

            // TODO Invoke Callback
        }

        if ( Event )
        {
            RTC_Warning( "Not handled events %X: RTCx=%d", Event, RTCx );
        }

        // TODO Either update RTC using the context timestamp
        // TODO or get the new timestamp into the context
        // FIXME For now use GET ONLY

        HAL_StatusTypeDef HAL_Status = HAL_OK;
        RTC_TimeTypeDef sTimeStamp;
        RTC_DateTypeDef sTimeStampDate;

        if ( ( HAL_Status = HAL_RTC_GetTime( &Instance->RTCx, &sTimeStamp, RTC_FORMAT_BIN ) ) != HAL_OK )
        {
            // FIXME
            RTC_Warning( "RTC=%d HAL_RTC_GetTime Failed, Status %d", RTCx, HAL_Status );
        }

        if ( ( HAL_Status = HAL_RTC_GetDate( &Instance->RTCx, &sTimeStampDate, RTC_FORMAT_BIN ) ) != HAL_OK )
        {
            // FIXME
            RTC_Warning( "RTC=%d HAL_RTC_GetDate Failed, Status %d", RTCx, HAL_Status );
        }

        Instance->Timestamp.Year = 2000 + sTimeStampDate.Year;
        Instance->Timestamp.Month = RTC_Bcd2ToByte( sTimeStampDate.Month );
        Instance->Timestamp.Day = sTimeStampDate.Date;

        Instance->Timestamp.Hour = sTimeStamp.Hours;
        Instance->Timestamp.Minute = sTimeStamp.Minutes;
        Instance->Timestamp.Second = sTimeStamp.Seconds;

        // @note sub-seconds value calculation breakdown:
        // @ref ss_val = ( PREDIV_S - SSR ) / ( PREDIV_S + 1 )
        double subseconds = sTimeStamp.SecondFraction - sTimeStamp.SubSeconds;
        subseconds /= sTimeStamp.SecondFraction + 1;
        Instance->Timestamp.Millisecond = ( uint32_t ) UTIL_SecondToMillisecond( subseconds ) % 1000;
        Instance->Timestamp.Microsecond = ( uint32_t ) UTIL_MillisecondToMicrosecond( UTIL_SecondToMillisecond( subseconds ) ) % 1000;

        Instance->Timestamp.Weekday = sTimeStampDate.WeekDay;
    }
    while ( 0 );

    return Status;
}

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Instance_DeInitialize( RTC_STM32L496VGT6P_t RTCx )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( RTCx=%d )", __FUNCTION__, RTCx );

        // FIXME De-Initialize RTC
        Status = RTC_STM32L496VGT6P_Status_NotSupported;
    }
    while ( 0 );

    return Status;
}

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Context_Initialize( void )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( void )", __FUNCTION__ );

        // FIXME Remove the usage of `MX_RTC_Init()`
        // FIXME Keep CubeMX generated configurations as is for now
    #if 1
        extern RTC_HandleTypeDef hrtc;
        extern void MX_RTC_Init( void );
        MX_RTC_Init( );
        RTC_STM32L496VGT6P_Context.Instance[ RTC_STM32L496VGT6P_1 ].RTCx = hrtc;
    #endif

        // FIXME RTC wake-up is being used as kernel ticks, ticks should be reported to kernel in some way
        // FIXME Also wake-up should have enable and disable procedures
        // @note Configures RTC to wake-up every ~1ms
        for ( RTC_STM32L496VGT6P_t RTC_x = RTC_STM32L496VGT6P_1; RTC_x < RTC_STM32L496VGT6P_Count; ++RTC_x )
        {
            RTC_STM32L496VGT6P_Instance_t * Instance = &RTC_STM32L496VGT6P_Context.Instance[ RTC_x ];

            HAL_StatusTypeDef HAL_Status = HAL_OK;
            if ( ( HAL_Status = HAL_RTCEx_SetWakeUpTimer_IT( &Instance->RTCx, RTC_STM32L496VGT6P_TICKS_PER_MS, RTC_WAKEUPCLOCK_RTCCLK_DIV16 ) ) != HAL_OK )
            {
                Status = RTC_STM32L496VGT6P_Status_Error;
                break;
            }
        }
    }
    while ( 0 );

