bassem-mostafa/RTC_STM32L496VGT6P/RTC_STM32L496VGT6P.c
    return Status;
}

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Context_Cycle( void )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( void )", __FUNCTION__ );

        UTIL_UNUSED( RTC_STM32L496VGT6P_Context );
    }
    while ( 0 );

    return Status;
}

static RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Context_DeInitialize( void )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( void )", __FUNCTION__ );

        UTIL_UNUSED( RTC_STM32L496VGT6P_Context );
    }
    while ( 0 );

    return Status;
}

// #############################################################################
// #### Public Method(s) #######################################################
// #############################################################################

RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Initialize( RTC_STM32L496VGT6P_t RTCx )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( RTCx=%d )", __FUNCTION__, RTCx );

        if ( ( Status = RTC_STM32L496VGT6P_Context_Initialize( ) ) != RTC_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        Status = RTC_STM32L496VGT6P_Instance_Initialize( RTCx );
    }
    while ( 0 );

    return Status;
}

RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_Cycle( RTC_STM32L496VGT6P_t RTCx )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;
    do
    {
        RTC_Trace( "%s( RTCx=%d )", __FUNCTION__, RTCx );

        if ( ( Status = RTC_STM32L496VGT6P_Context_Cycle( ) ) != RTC_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        Status = RTC_STM32L496VGT6P_Instance_Cycle( RTCx );
    }
    while ( 0 );

    return Status;
}

RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_DeInitialize( RTC_STM32L496VGT6P_t RTCx )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;
    do
    {
        RTC_Trace( "%s( RTCx=%d )", __FUNCTION__, RTCx );

        if ( ( Status = RTC_STM32L496VGT6P_Instance_DeInitialize( RTCx ) ) != RTC_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        Status = RTC_STM32L496VGT6P_Context_DeInitialize( );
    }
    while ( 0 );

    return Status;
}

RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_GetTimestamp( RTC_STM32L496VGT6P_t RTCx, RTC_STM32L496VGT6P_Timestamp_t * Timestamp )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( RTCx=%d, Timestamp=%p )", __FUNCTION__, RTCx, Timestamp );

        Status = RTC_STM32L496VGT6P_Instance_GetTimestamp( RTCx, Timestamp );
    }
    while ( 0 );

    return Status;
}

RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_SetTimestamp( RTC_STM32L496VGT6P_t RTCx, RTC_STM32L496VGT6P_Timestamp_t Timestamp )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( RTCx=%d, Timestamp={Weekday=%d, Year=%d, Month=%d, Day=%d, Hour=%d, Minute=%d, Second=%d, Millisecond=%d, Microsecond=%d} )", __FUNCTION__, RTCx, Timestamp.Weekday, Timestamp.Year, Timestamp.Month, Timestamp.Day, Timestamp.Hour, Timestamp.Minute, Timestamp.Second, Timestamp.Millisecond, Timestamp.Microsecond );

        Status = RTC_STM32L496VGT6P_Instance_SetTimestamp( RTCx, Timestamp );
    }
    while ( 0 );

    return Status;
}

RTC_STM32L496VGT6P_Status_t RTC_STM32L496VGT6P_SetAlarm( RTC_STM32L496VGT6P_t RTCx, RTC_STM32L496VGT6P_Timestamp_t Timestamp )
{
    RTC_STM32L496VGT6P_Status_t Status = RTC_STM32L496VGT6P_Status_Success;

    do
    {
        RTC_Trace( "%s( RTCx=%d, Timestamp={Weekday=%d, Year=%d, Month=%d, Day=%d, Hour=%d, Minute=%d, Second=%d, Millisecond=%d, Microsecond=%d} )", __FUNCTION__, RTCx, Timestamp.Weekday, Timestamp.Year, Timestamp.Month, Timestamp.Day, Timestamp.Hour, Timestamp.Minute, Timestamp.Second, Timestamp.Millisecond, Timestamp.Microsecond );

        Status = RTC_STM32L496VGT6P_Instance_SetAlarm( RTCx, Timestamp );
    }
    while ( 0 );

    return Status;
}

// #############################################################################
// #### Public Variable(s) #####################################################
// #############################################################################

// #############################################################################
// #### File Guard #############################################################
// #############################################################################

#endif /* STM32L496xx */

// #############################################################################
// #### END OF FILE ############################################################
// #############################################################################
